# Assignment

## Brief

Write the Python codes for the following questions.

## Instructions

Paste the answer as Python in the answer code section below each question.

### Question 1

Question: Select all numeric columns except float from the DataFrame `dft`.

Answer:

In [2]:
import pandas as pd
import numpy as np

In [7]:
dft = pd.DataFrame({
    "int_col": np.random.randint(1, 100, size=10),
    "float_col": np.random.uniform(1.0, 100.0, size=10)
})
dft

   int_col  float_col
0       71  22.069063
1       55   1.560131
2        9  15.045057
3       26   9.670939
4       24  63.208022
5       72  97.460470
6        9  63.113005
7       65  40.059296
8       65  22.222298
9       24  25.106145

In [8]:
dft.select_dtypes(include='number', exclude='float')
# Select only numeric columns, excluding floats

   int_col
0       71
1       55
2        9
3       26
4       24
5       72
6        9
7       65
8       65
9       24

### Question 2

Question: How do you return the last 3 rows of a DataFrame `df`?

Answer:

In [11]:
df = dft.select_dtypes(include='number', exclude='float')

df.tail(3)
# Display the last three rows of the DataFrame df.

   int_col
7       65
8       65
9       24

### Question 3

Question: Return the minimum and maximum of a Series `x` as a new Series with the index `["min", "max"]`.

Answer:

In [20]:
X = df["int_col"]

New_X = pd.Series([X.max(), X.min()], index=['max', 'min'])
# Create a new Series with the maximum and minimum values of df
New_X

max    72
min     9
dtype: int64

### Question 4

Question: Multiply `df1` and `df2` (two DataFrames) with a `fill_value` of 1.

Answer:

In [31]:
# Create a 4x5 array of random integers from 0 to 100
data = np.random.randint(10, 20, size=(4, 5)).astype(float)

# Randomly assign a few NaN values
data[0, 1] = np.nan
data[2, 3] = np.nan
data[3, 0] = np.nan

# Create DataFrame
dft1 = pd.DataFrame(data, columns=[f'col_{i}' for i in range(1, 6)])
dft1

   col_1  col_2  col_3  col_4  col_5
0   16.0    NaN   10.0   19.0   11.0
1   18.0   11.0   14.0   13.0   12.0
2   13.0   10.0   12.0    NaN   15.0
3    NaN   18.0   10.0   16.0   16.0

In [32]:
# Create a 4x5 array of random integers from 0 to 100
data = np.random.randint(5, 15, size=(4, 6)).astype(float)

# Create DataFrame
dft2 = pd.DataFrame(data, columns=[f'col_{i}' for i in range(1, 7)])
dft2

   col_1  col_2  col_3  col_4  col_5  col_6
0   10.0   12.0   13.0    9.0    9.0    6.0
1    5.0    9.0   12.0    7.0   13.0    6.0
2   12.0   14.0   10.0   12.0    7.0    9.0
3   12.0    5.0   13.0    9.0    5.0   13.0

In [33]:
dft1.multiply(dft2, fill_value=1)

   col_1  col_2  col_3  col_4  col_5  col_6
0  160.0   12.0  130.0  171.0   99.0    6.0
1   90.0   99.0  168.0   91.0  156.0    6.0
2  156.0  140.0  120.0   12.0  105.0    9.0
3   12.0   90.0  130.0  144.0   80.0   13.0

### Question 5

Question: How do you create a DataFrame from a nested dictionary of dictionaries?

In [34]:
nested_dict = {'A': {'a': 1, 'b': 2}, 'B': {'a': 3, 'b': 4}}

Answer:

In [36]:
df = pd.DataFrame(nested_dict)

df

   A  B
a  1  3
b  2  4

## Submission

- Submit the URL of the GitHub Repository that contains your work to NTU black board.
- Should you reference the work of your classmate(s) or online resources, give them credit by adding either the name of your classmate or URL.